
"_instructions1": "This is a template for JSON files that can provide a standard way to add new services to the cloud catalog, maintained with this repository."

"_instructions2": "Please create a new JSON file to add a new service to the catalog. While creating that file based on this template, please consider the comments below to fill the items to have a standard representation of services. Please feel free to raise an issue or give feedback for the template in the issues section (https://github.com/VHP4Safety/cloud/issues) of this repository."

{
  
  "_ins_id": "An id for the JSON file, needs to be the same name as this JSON file.",
  "id": "",

  "_ins_service": "// The (stylized) name of the service which will be shown as the name of the service in the catalog.",
  "service": "",

  "_ins_description": "A short description for the service.",
  "description": "",

  "_ins_screenshot": "The name of the file for the service logo, needs to be the same name as the service id but with a different extension.", 
  "screenshot": "",

  "_ins_url": "The original URL to the service.",
  "url": "",
  
  "_ins_doi": "The DOI of the document (article, preprint, etc.) related to the service.",
  "doi": "",

  "instance": {

    "_ins_type": "Whether the instance 'internal' or 'external'",
    "type": "",

    "_ins_chp-platform": "Whether the instance running on 'development' or 'production' platform.",  
    "vhp-platform": "",

    "_ins_url": "URL to the service instance running on our servers.", 
    "url": "",

    "license": "",
    "version": "",

    "ins_source": "Link to the source material of the service.",
    "source": "",

    "_ins_docker": "Link to the repository with service's Docker container.",
    "docker": "",

    "_ins_TRL": "Technology Readiness Level. For details, please see: https://en.wikipedia.org/wiki/Technology_readiness_level",
    "TRL": ""
  },

  "provider": {
    "contact": {
      "_ins_name": "The name of a person from the organization that provide the service.",
      "name": "",
      "_ins_email": "The email of the person whose name given above.",
      "email": ""
    },

    "_ins_name": "The name of the organization that provide the service.",
    "name": "",
    "_ins_url": "An URL to the organization that provide the service.",
    "url": ""
  },

  "_ins_access": "Information regarding the remote use of the service.",
  "access": {
    "_ins_API": "The type of API, if available.",
    "API": "",
    
    "_ins_login": "Whether the API requires authenication.",
    "login": "",

    "packages": {
      "R": "",
      "Python": ""
    }
  },

  "_ins_intro": "Information regarding an available demo documentation available on the docs repo.", 
  "intro": {
    "_ins_title": "The title of the intro on the VHP4Safety platform. Multiple entries should be separated by a ';'",
    "title": "",
    "_ins_url": "Link to the intro on the VHP4Safety platform. Multiple entries should be separated by a ';'",
    "url": ""
  },

  "demo": {
    "_ins_title": "The title of the demo?",
    "title": "",
    "_ins_url": "The link to the demo?", 
    "url": ""
  },

  "workflow": {
    "_ins_title": "The title of the VHP4Safety workflow where it is being used. Multiple entries should be separated by a ';'",
    "title": "",
    "_ins_url": "Link to the workflow. Multiple entries should be separated by a ';'",
    "url": "",
  },

  "_ins_ELIXIR": "Information regarding sources available on ELIXIR.",
  "ELIXIR": {
    "_ins_biotools": "The keyword for the link to the source on bio.tools.",
    "biotools": "",
    
    "_ins_tess": "The keyword for link to the source on TeSS.",
    "tess": "",
    
    "_ins_fairsharing": "The DOI for the entry on FAIRsharing.org",
    "fairsharing": ""
  },

  "Other": {
    "_ins_wikipedia": "Wikipedia page",
    "wikipedia": "",
    "_ins_rsd": "Dutch Research Software Directory.",
    "rsd": ""
  },

  
  "_ins_NAM-validation": "Information about NAM validation stage as described in the 2017 RIVM report (https://www.rivm.nl/documenten/landschap-3v-methoden-risicobeoordeling-chemische-stoffen), Answer whether the service has completed the stage using as 'yes' or 'no'.",
  "NAM-validation": {
    "_ins_NAM-stage1": "Stage 1: Research & development.",
    "NAM-stage-1": "",
    
    "_ins_NAM-stage2": "Stage 2: Validation.",
    "NAM-stage-2": "",
    
    "_ins_NAM-stage3": "Stage 3: Evaluation.",
    "NAM-stage-3": "",
    
    "_ins_NAM-stage4": "Stage 4: Acceptation.",
    "NAM-stage-4": "",
    
    "_ins_NAM-stage5": "Stage 5: Implementation.",
    "NAM-stage-5": ""
  },

  "_ins_VHP-persona": "Whether the service is used by one or more of the VHP persona's. Answer as 'true' or 'false' (e.g., persona-1: 'true' to attribute a service to a persona).",
  "VHP-persona": {
    "persona-1": "",
    "persona-2": "",
    "persona-3": ""
  },

  "_ins_regulatory-question": "Whether the service is relevant to any of the regulatory questions (https://docs.vhp4safety.nl/en/latest/introduction/case_studies_and_regulatory_questions.html). Answer either 'true' or 'false'",
  "regulatory-question": {
    "_ins_1a": "1a: What is a safe dose for cisplatin/tacrolimus in patients with respect to chronic kidney disease?",
    "1a": "",
    
    "_ins_1b": "1b: How can we take into account variability in activity/expression of P-gp in patients that underwent a transplantation?",
    "1b": "",
    
    "_ins_2a": "2a: Can compound X cause Parkinson’s Disease?",
    "2a": "",
    
    "_ins_2b": "2b: Can we identify groups at extra risk to develop Parkinson’s Disease after exposure to compound X?",
    "2b": "",
    
    "_ins_3a": "3a: What information about a substance do we need to give an advice to women in their early pregnancy to decide whether the substance can be used?",
    "3a": "",

    "_ins_3b": "3b: Does compound X influence the thyroid-mediated brain development in the fetus resulting in cognitive impairment in children?",
    "3b": ""
  }
}
